index=sysmon EventCode=11
| search TargetFilename="*.aspx" (TargetFilename="*\\inetpub\\wwwroot\\wss\\*" OR TargetFilename="*\\_layouts\\*" OR TargetFilename="*\\_layouts\\15\\*")
| stats values(TargetFilename) as files by host, user

